Model: "mAlexNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input (InputLayer)           [(None, 150, 150, 3)]     0         
_________________________________________________________________
resizing (Resizing)          (None, 224, 224, 3)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 54, 54, 16)        5824      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 26, 26, 16)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 22, 22, 20)        8020      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 10, 10, 20)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 30)          5430      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 3, 3, 30)          0         
_________________________________________________________________
dense (Dense)                (None, 3, 3, 48)          1488      
_________________________________________________________________
flatten (Flatten)            (None, 432)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 433       
=================================================================
Total params: 21,195
Trainable params: 21,195
Non-trainable params: 0
_________________________________________________________________
None
