Model: "mDenseNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input (InputLayer)              [(None, 150, 150, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 29, 29, 16)   2368        Input[0][0]                      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 14, 14, 16)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 14, 14, 16)   64          max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 14, 14, 16)   272         batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 14, 14, 16)   2320        conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 14, 14, 16)   64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 16)   272         batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 14, 14, 16)   2320        conv2d_3[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 14, 14, 32)   0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 14, 14, 32)   128         concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 14, 14, 16)   528         batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 14, 14, 16)   2320        conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 14, 14, 16)   64          conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 14, 14, 16)   272         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 7, 7, 16)     0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 16)           0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            17          global_average_pooling2d[0][0]   
==================================================================================================
Total params: 11,009
Trainable params: 10,849
Non-trainable params: 160
__________________________________________________________________________________________________
None
