Model: "SimpleResNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input (InputLayer)              [(None, 150, 150, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 148, 148, 32) 896         Input[0][0]                      
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 146, 146, 64) 18496       conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 48, 48, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 48, 48, 64)   36928       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 48, 48, 64)   36928       conv2d_2[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 48, 48, 64)   0           conv2d_3[0][0]                   
                                                                 max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 48, 48, 64)   36928       add[0][0]                        
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 48, 48, 64)   36928       conv2d_4[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 48, 48, 64)   0           conv2d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 46, 46, 64)   36928       add_1[0][0]                      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 64)           0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, 256)          16640       global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          65792       dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 256)          65792       dense_1[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 256)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1)            257         dropout[0][0]                    
==================================================================================================
Total params: 352,513
Trainable params: 352,513
Non-trainable params: 0
__________________________________________________________________________________________________
None
