Model: "SimpleDenseNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
Input (InputLayer)              [(None, 150, 150, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 72, 72, 32)   4736        Input[0][0]                      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 35, 35, 32)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 35, 35, 32)   128         max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 35, 35, 64)   2112        batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 35, 35, 64)   36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 35, 35, 64)   256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 35, 35, 64)   4160        batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 35, 35, 64)   36928       conv2d_3[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 35, 35, 128)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 35, 35, 128)  512         concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 35, 35, 64)   8256        batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 35, 35, 64)   36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 35, 35, 192)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 35, 35, 192)  768         concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 35, 35, 64)   12352       batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 35, 35, 64)   36928       conv2d_7[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 35, 35, 256)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 35, 35, 256)  1024        concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 35, 35, 64)   16448       batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 35, 35, 64)   36928       conv2d_9[0][0]                   
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 35, 35, 320)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_8[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 35, 35, 320)  1280        concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 35, 35, 64)   20544       batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 35, 35, 64)   36928       conv2d_11[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 35, 35, 384)  0           conv2d_2[0][0]                   
                                                                 conv2d_4[0][0]                   
                                                                 conv2d_6[0][0]                   
                                                                 conv2d_8[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 35, 35, 384)  1536        concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 35, 35, 64)   24640       batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 35, 35, 64)   36928       conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 35, 35, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 35, 35, 64)   4160        batch_normalization_7[0][0]      
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 17, 17, 64)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 64)           0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            65          global_average_pooling2d[0][0]   
==================================================================================================
Total params: 361,729
Trainable params: 358,849
Non-trainable params: 2,880
__________________________________________________________________________________________________
None
